rorke-time/experiment1-sriov-rorke-time/rorke1250-memtier-250k.txt
Executing: memtier_benchmark -h 128.110.218.200 -p 11211 --ratio=1:10 --test-time=30 --rate-limiting=1250 -t 8 -c 25 --key-pattern=P:P --key-maximum 1000000 -P memcache_text
8         Threads
25        Connections per thread
30        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        14755.28          ---          ---         1.01410         0.31100         4.41500         7.51900       992.58 
Gets       147519.19     48202.01     99317.19         1.00459         0.30300         4.28700         7.35900      6450.82 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     162274.47     48202.01     99317.19         1.00546         0.30300         4.31900         7.39100      7443.41 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.039        0.000
SET       0.095        5.000
SET       0.111       10.000
SET       0.135       15.000
SET       0.151       20.000
SET       0.167       25.000
SET       0.191       30.000
SET       0.207       35.000
SET       0.239       40.000
SET       0.271       45.000
SET       0.311       50.000
SET       0.335       52.500
SET       0.367       55.000
SET       0.423       57.500
SET       0.511       60.000
SET       1.111       62.500
SET       1.511       65.000
SET       1.591       67.500
SET       1.679       70.000
SET       1.783       72.500
SET       1.927       75.000
SET       2.047       76.250
SET       2.223       77.500
SET       2.399       78.750
SET       2.447       80.000
SET       2.495       81.250
SET       2.511       82.500
SET       2.527       83.750
SET       2.543       85.000
SET       2.559       86.250
SET       2.575       87.500
SET       2.575       88.125
SET       2.575       88.750
SET       2.591       89.375
SET       2.591       90.000
SET       2.591       90.625
SET       2.607       91.250
SET       2.607       91.875
SET       2.623       92.500
SET       2.623       93.125
SET       2.639       93.750
SET       2.655       94.062
SET       2.655       94.375
SET       2.655       94.688
SET       2.671       95.000
SET       2.687       95.312
SET       2.687       95.625
SET       2.703       95.938
SET       2.719       96.250
SET       2.735       96.562
SET       2.767       96.875
SET       2.767       97.031
SET       2.783       97.188
SET       2.815       97.344
SET       2.847       97.500
SET       2.879       97.656
SET       2.927       97.812
SET       2.991       97.969
SET       3.103       98.125
SET       3.247       98.281
SET       3.615       98.438
SET       3.775       98.516
SET       3.871       98.594
SET       3.967       98.672
SET       4.063       98.750
SET       4.159       98.828
SET       4.255       98.906
SET       4.383       98.984
SET       4.543       99.062
SET       4.863       99.141
SET       5.023       99.219
SET       5.055       99.258
SET       5.087       99.297
SET       5.119       99.336
SET       5.151       99.375
SET       5.183       99.414
SET       5.183       99.453
SET       5.247       99.492
SET       5.279       99.531
SET       5.375       99.570
SET       5.503       99.609
SET       5.535       99.629
SET       5.599       99.648
SET       5.663       99.668
SET       5.727       99.688
SET       5.823       99.707
SET       6.015       99.727
SET       6.239       99.746
SET       6.303       99.766
SET       6.367       99.785
SET       6.431       99.805
SET       6.463       99.814
SET       6.495       99.824
SET       6.559       99.834
SET       6.623       99.844
SET       6.751       99.854
SET       6.879       99.863
SET       7.007       99.873
SET       7.231       99.883
SET       7.455       99.893
SET       7.551       99.902
SET       7.583       99.907
SET       7.615       99.912
SET       7.647       99.917
SET       7.647       99.922
SET       7.679       99.927
SET       7.711       99.932
SET       7.743       99.937
SET       7.775       99.941
SET       7.839       99.946
SET       7.935       99.951
SET       7.999       99.954
SET       8.063       99.956
SET       8.159       99.958
SET       8.191       99.961
SET       8.319       99.963
SET       8.639       99.966
SET       8.767       99.968
SET       8.831       99.971
SET       8.895       99.973
SET       8.959       99.976
SET       8.959       99.977
SET       9.023       99.978
SET       9.023       99.979
SET       9.087       99.980
SET       9.087       99.982
SET       9.151       99.983
SET       9.215       99.984
SET       9.343       99.985
SET       9.471       99.987
SET       9.727       99.988
SET       9.919       99.988
SET      10.047       99.989
SET      10.047       99.990
SET      10.111       99.990
SET      10.111       99.991
SET      10.175       99.991
SET      10.175       99.992
SET      10.239       99.993
SET      10.239       99.993
SET      10.303       99.994
SET      10.303       99.994
SET      10.303       99.995
SET      10.303       99.995
SET      10.303       99.995
SET      10.431       99.995
SET      10.495       99.996
SET      10.495       99.996
SET      10.559       99.996
SET      10.623       99.997
SET      10.687       99.997
SET      10.687       99.997
SET      10.751       99.997
SET      10.751       99.997
SET      10.751       99.998
SET      10.751       99.998
SET      10.879       99.998
SET      10.879       99.998
SET      11.263       99.998
SET      11.519       99.998
SET      11.583       99.998
SET      11.583       99.999
SET      11.583       99.999
SET      12.031       99.999
SET      12.031       99.999
SET      12.031       99.999
SET      12.095       99.999
SET      12.095       99.999
SET      12.095       99.999
SET      12.351       99.999
SET      12.351       99.999
SET      12.351       99.999
[...]
SET      12.863       99.999
SET      12.863       99.999
SET      12.863       99.999
[...]
SET      12.863      100.000
SET      12.863      100.000
SET      13.055      100.000
SET      13.055      100.000
SET      13.055      100.000
[...]
SET      14.143      100.000
SET      14.143      100.000
---
GET       0.039        0.000
GET       0.087        5.000
GET       0.111       10.000
GET       0.127       15.000
GET       0.143       20.000
GET       0.167       25.000
GET       0.183       30.000
GET       0.207       35.000
GET       0.231       40.000
GET       0.263       45.000
GET       0.303       50.000
GET       0.327       52.500
GET       0.367       55.000
GET       0.415       57.500
GET       0.495       60.000
GET       0.935       62.500
GET       1.495       65.000
GET       1.583       67.500
GET       1.663       70.000
GET       1.767       72.500
GET       1.927       75.000
GET       2.039       76.250
GET       2.207       77.500
GET       2.383       78.750
GET       2.447       80.000
GET       2.479       81.250
GET       2.511       82.500
GET       2.527       83.750
GET       2.543       85.000
GET       2.559       86.250
GET       2.559       87.500
GET       2.575       88.125
GET       2.575       88.750
GET       2.575       89.375
GET       2.591       90.000
GET       2.591       90.625
GET       2.607       91.250
GET       2.607       91.875
GET       2.623       92.500
GET       2.623       93.125
GET       2.639       93.750
GET       2.639       94.062
GET       2.655       94.375
GET       2.655       94.688
GET       2.671       95.000
GET       2.671       95.312
GET       2.687       95.625
GET       2.703       95.938
GET       2.703       96.250
GET       2.735       96.562
GET       2.751       96.875
GET       2.767       97.031
GET       2.783       97.188
GET       2.799       97.344
GET       2.815       97.500
GET       2.847       97.656
GET       2.879       97.812
GET       2.943       97.969
GET       3.023       98.125
GET       3.135       98.281
GET       3.359       98.438
GET       3.583       98.516
GET       3.775       98.594
GET       3.871       98.672
GET       3.983       98.750
GET       4.079       98.828
GET       4.159       98.906
GET       4.287       98.984
GET       4.415       99.062
GET       4.639       99.141
GET       4.959       99.219
GET       5.023       99.258
GET       5.055       99.297
GET       5.087       99.336
GET       5.119       99.375
GET       5.151       99.414
GET       5.183       99.453
GET       5.215       99.492
GET       5.247       99.531
GET       5.343       99.570
GET       5.439       99.609
GET       5.503       99.629
GET       5.567       99.648
GET       5.631       99.668
GET       5.663       99.688
GET       5.759       99.707
GET       5.887       99.727
GET       6.143       99.746
GET       6.271       99.766
GET       6.335       99.785
GET       6.399       99.805
GET       6.431       99.814
GET       6.463       99.824
GET       6.495       99.834
GET       6.527       99.844
GET       6.623       99.854
GET       6.719       99.863
GET       6.847       99.873
GET       6.975       99.883
GET       7.167       99.893
GET       7.423       99.902
GET       7.487       99.907
GET       7.551       99.912
GET       7.583       99.917
GET       7.615       99.922
GET       7.647       99.927
GET       7.679       99.932
GET       7.679       99.937
GET       7.711       99.941
GET       7.743       99.946
GET       7.807       99.951
GET       7.839       99.954
GET       7.871       99.956
GET       7.903       99.958
GET       7.967       99.961
GET       8.031       99.963
GET       8.095       99.966
GET       8.191       99.968
GET       8.319       99.971
GET       8.511       99.973
GET       8.703       99.976
GET       8.767       99.977
GET       8.831       99.978
GET       8.831       99.979
GET       8.895       99.980
GET       8.959       99.982
GET       8.959       99.983
GET       9.023       99.984
GET       9.023       99.985
GET       9.087       99.987
GET       9.087       99.988
GET       9.151       99.988
GET       9.215       99.989
GET       9.279       99.990
GET       9.343       99.990
GET       9.407       99.991
GET       9.471       99.991
GET       9.535       99.992
GET       9.727       99.993
GET       9.919       99.993
GET      10.047       99.994
GET      10.111       99.994
GET      10.111       99.995
GET      10.175       99.995
GET      10.239       99.995
GET      10.303       99.995
GET      10.303       99.996
GET      10.367       99.996
GET      10.367       99.996
GET      10.431       99.997
GET      10.559       99.997
GET      10.559       99.997
GET      10.623       99.997
GET      10.623       99.997
GET      10.687       99.998
GET      10.751       99.998
GET      10.751       99.998
GET      10.815       99.998
GET      10.879       99.998
GET      11.071       99.998
GET      11.263       99.998
GET      11.327       99.999
GET      11.391       99.999
GET      11.391       99.999
GET      11.455       99.999
GET      11.455       99.999
GET      11.519       99.999
GET      11.519       99.999
GET      11.583       99.999
GET      11.647       99.999
GET      11.647       99.999
GET      11.647       99.999
[...]
GET      11.711       99.999
GET      11.711       99.999
GET      11.775       99.999
GET      11.775       99.999
GET      11.839      100.000
GET      11.839      100.000
GET      11.903      100.000
GET      12.287      100.000
GET      12.287      100.000
GET      12.479      100.000
GET      12.479      100.000
GET      12.735      100.000
GET      12.735      100.000
GET      12.799      100.000
GET      12.863      100.000
GET      12.863      100.000
GET      12.863      100.000
GET      12.991      100.000
GET      12.991      100.000
GET      13.055      100.000
GET      13.055      100.000
GET      13.119      100.000
GET      13.119      100.000
GET      13.119      100.000
GET      13.247      100.000
GET      13.247      100.000
GET      13.247      100.000
[...]
GET      13.311      100.000
GET      13.311      100.000
GET      13.311      100.000
[...]
GET      14.271      100.000
GET      14.271      100.000
GET      14.271      100.000
[...]
GET      14.335      100.000
GET      14.335      100.000
GET      14.335      100.000
[...]
GET      14.399      100.000
GET      14.399      100.000
---
WAIT      0.000      100.000